---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectShapeOptions
source: html/d3ba3867-4164-499d-5679-c622367cd951.htm
---
# DirectShapeOptions Members

Releases all resources used by the DirectShapeOptions